In [3]:
import pandas as pd

file_to_read = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_df = pd.read_csv(file_to_read)

In [4]:
purchase_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [5]:
purchase_df.shape

(780, 7)

In [6]:
purchase_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 780 entries, 0 to 779
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Purchase ID  780 non-null    int64
 1   SN           780 non-null    object
 2   Age          780 non-null    int64
 3   Gender       780 non-null    object
 4   Item ID      780 non-null    int64
 5   Item Name    780 non-null    object
 6   Price        780 non-null    float64
dtypes: float64(1), int64(3), object(3)
memory usage: 42.8+ KB

In [7]:
purchase_df.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   91.755128    3.050987
std     225.310896    6.659444   52.697702    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   47.750000    1.980000
50%     389.500000   22.000000   92.000000    3.150000
75%     584.250000   25.000000  138.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [8]:
## Player Count

In [9]:
players = purchase_df["SN"].unique()
#print (players)

total_players = len(players)
total_players_df = pd.DataFrame({"Total Players":[total_players]})
total_players_df

   Total Players
0            576

In [10]:
purchase_df.SN.value_counts()

Lisosia93         5
Idastidru52       4
Iral74            4
Sondastsda82      3
Chamimla85        3
                 ..
Undirrasta89      1
Aerithnuphos61    1
Tyeuduen32        1
Eulolis41         1
Chamalo71         1
Name: SN, Length: 576, dtype: int64

In [11]:
gender_array = purchase_df.Gender.unique()
gender_array
purchase_df.Gender.value_counts()

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [12]:
##Purchasing Analysis (Total)

In [14]:
unique_items = purchase_df["Item ID"].unique()
num_unique_items = len(unique_items)
average_price = purchase_df["Price"].mean()
unique_number_purchases = purchase_df['Purchase ID'].unique()
count_unique_number_purchases = len(unique_number_purchases)
total_revenue = purchase_df["Price"].sum()

In [15]:
total_purchase_df = pd.DataFrame({"Number of Unique Items":[num_unique_items],
                                  "Average Price":[average_price],
                                  "Number of Purchases":[count_unique_number_purchases],
                                  "Total Revenue":[total_revenue]})
total_purchase_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [19]:
##Gender Demographics

In [21]:
#gender_df = pd.DataFrame({"SN":purchase_df.SN,
 #                        "Age":purchase_df.Age,
 #                        "Gender":purchase_df.Gender})
#gender_df.head()
#gender_df.drop_duplicates()

In [27]:
gender_df = purchase_df.filter(['SN','Age','Gender'])#,axis=1
gender_df

                SN  Age  Gender
0          Lisim78   20    Male
1      Lisovynya38   40    Male
2       Ithergue48   24    Male
3    Chamassasya86   24    Male
4        Iskosia90   23    Male
..             ...  ...     ...
775     Aethedru70   21  Female
776         Iral74   21    Male
777     Yathecal72   20    Male
778        Sisur91    7    Male
779      Ennrian78   24    Male

[780 rows x 3 columns]

In [28]:
gender_df = gender_df.drop_duplicates()
gender_df

                SN  Age  Gender
0          Lisim78   20    Male
1      Lisovynya38   40    Male
2       Ithergue48   24    Male
3    Chamassasya86   24    Male
4        Iskosia90   23    Male
..             ...  ...     ...
773         Hala31   21    Male
774     Jiskjask80   11    Male
775     Aethedru70   21  Female
777     Yathecal72   20    Male
778        Sisur91    7    Male

[576 rows x 3 columns]

In [29]:
total_gender_new = gender_df["Gender"].value_counts()
total_gender_new

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [30]:
gender_demog_percent = (total_gender_new * 100)/ total_players
gender_demog_percent
gender_demographics = pd.DataFrame({"Total Count": total_gender_new,
                                    "Percentage of Players": gender_demog_percent})
gender_demographics

                       Total Count  Percentage of Players
Male                           484              84.027778
Female                          81              14.062500
Other / Non-Disclosed           11               1.909722

In [19]:
##Purchasing Analysis (Gender)

In [49]:
gender_group = purchase_df.groupby(["Gender"])

In [50]:
average_purchase_price = gender_group["Price"].mean()
average_purchase_price

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [51]:
total_purchase_value = gender_group["Price"].sum()
total_purchase_value

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [52]:
purchase_count = gender_group["Purchase ID"].count()
purchase_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [53]:
purchase_analysis = pd.DataFrame({"Purchase Count":purchase_count,
                                  "Average Purchase Price":average_purchase_price.map("${:.2f}".format),
                                 "Total Purchase Value":total_purchase_value.map("${:.2f}".format)})
purchase_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value
Gender,,,
Female,113,$3.20,$361.94
Male,652,$3.02,$1967.64
Other / Non-Disclosed,15,$3.35,$50.19

In [25]:
##Age Demographics

In [43]:
max_age = purchase_df.Age.max()

#print (max_age)
#create the bin
bins = [0,9.99,14,19,24,29,34,39,max_age+1]

group_names = ["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [44]:
gender_df['Age Ranges'] = pd.cut(gender_df['Age'],bins=bins,labels=group_names)
gender_df

<ipython-input-44-6dc9d81e5f6f>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  gender_df['Age Ranges'] = pd.cut(gender_df['Age'],bins=bins,labels=group_names)

                SN  Age  Gender Age Ranges
0          Lisim78   20    Male      20-24
1      Lisovynya38   40    Male        40+
2       Ithergue48   24    Male      20-24
3    Chamassasya86   24    Male      20-24
4        Iskosia90   23    Male      20-24
..             ...  ...     ...        ...
773         Hala31   21    Male      20-24
774     Jiskjask80   11    Male      10-14
775     Aethedru70   21  Female      20-24
777     Yathecal72   20    Male      20-24
778        Sisur91    7    Male        <10

[576 rows x 4 columns]

In [45]:
age_ranges_group = gender_df.groupby(["Age Ranges"])

In [46]:
total_count = age_ranges_group["SN"].count()
total_count

Age Ranges
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [47]:
percent_of_players = (total_count * 100) / total_players
percent_of_players

Age Ranges
<10       2.951389
10-14     3.819444
15-19    18.576389
20-24    44.791667
25-29    13.368056
30-34     9.027778
35-39     5.381944
40+       2.083333
Name: SN, dtype: float64

In [48]:
age_demographics = pd.DataFrame({"Total Count": total_count,
                                    "Percentage of Players": percent_of_players})
age_demographics

            Total Count  Percentage of Players
Age Ranges
<10                  17               2.951389
10-14                22               3.819444
15-19               107              18.576389
20-24               258              44.791667
25-29                77              13.368056
30-34                52               9.027778
35-39                31               5.381944
40+                  12               2.083333

In [35]:
## Purchasing Analysis (Age)

In [54]:
purchase_df['Age Ranges'] = pd.cut(purchase_df['Age'],bins=bins,labels=group_names)
purchase_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [37]:
pd_group_names = purchase_df.groupby(["Age Ranges"])

In [38]:
average_price_age_range = pd_group_names["Price"].mean()
average_price_age_range

Age Ranges
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [39]:
purchase_count_age_range = pd_group_names["Purchase ID"].count()
purchase_count_age_range

Age Ranges
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Purchase ID, dtype: int64

In [40]:
total_price_age_range = pd_group_names["Price"].sum()
total_price_age_range

Age Ranges
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [72]:
purchasing_analysis = pd.DataFrame({"Purchase Count": purchase_count_age_range,
                                    "Average Purchase Price": average_price_age_range.map("${:.2f}".format),
                                   "Total Purchase Value":total_price_age_range.map("${:.2f}".format)})
purchasing_analysis

            Purchase Count Average Purchase Price Total Purchase Value
Age Ranges
<10                     23                  $3.35               $77.13
10-14                   28                  $2.96               $82.78
15-19                  136                  $3.04              $412.89
20-24                  365                  $3.05             $1114.06
25-29                  101                  $2.90              $293.00
30-34                   73                  $2.93              $214.00
35-39                   41                  $3.60              $147.67
40+                     13                  $2.94               $38.24

In [42]:
## Top Spenders

In [43]:
top_spenders_group = purchase_df.groupby(["SN"])

In [44]:
top_spenders_total_purchase = top_spenders_group["Price"].sum()
top_spenders_total_purchase

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [45]:
top_spenders_average_purchase_price = top_spenders_group["Price"].mean()
top_spenders_average_purchase_price

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [46]:
top_spenders_purchase_count = top_spenders_group["Purchase ID"].count()
top_spenders_purchase_count

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Purchase ID, Length: 576, dtype: int64

In [75]:
top_spenders_demografics = pd.DataFrame({"Purchase Count": top_spenders_purchase_count,
                                    "Average Purchase Price": top_spenders_average_purchase_price,
                                   "Total Purchase Value":top_spenders_total_purchase})
top_spenders_demografics

               Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76                1                2.280000                  2.28
Adastirin33                 1                4.480000                  4.48
Aeda94                      1                4.910000                  4.91
Aela59                      1                4.320000                  4.32
Aelaria33                   1                1.790000                  1.79
...                       ...                     ...                   ...
Yathecal82                  3                2.073333                  6.22
Yathedeu43                  2                3.010000                  6.02
Yoishirrala98               1                4.580000                  4.58
Zhisrisu83                  2                3.945000                  7.89
Zontibe81                   3                2.676667                  8.03

[576 rows x 3 columns]

In [76]:
top_spenders_demografics.sort_values("Total Purchase Value", ascending=False).head(5)

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [49]:
#Most Popular Items

In [55]:
purchase_df["Item ID"].value_counts().head(5)

92     13
178    12
108     9
132     9
82      9
Name: Item ID, dtype: int64

In [56]:
item_group = purchase_df.groupby(["Item ID","Item Name"])

In [57]:
most_pop_total_purchase = item_group["Price"].sum()
most_pop_total_purchase

Item ID  Item Name
0        Splinter                                         5.12
1        Crucifer                                        11.77
2        Verdict                                         14.88
3        Phantomlight                                    14.94
4        Bloodlord's Fetish                               8.50
                                                         ...
178      Oathbreaker, Last Hope of the Breaking Storm    50.76
179      Wolf, Promise of the Moonwalker                 26.88
181      Reaper's Toll                                    8.30
182      Toothpick                                       12.09
183      Dragon's Greatsword                              3.27
Name: Price, Length: 179, dtype: float64

In [58]:
most_pop_average_price = item_group["Price"].mean()
most_pop_average_price

Item ID  Item Name
0        Splinter                                        1.2800
1        Crucifer                                        2.9425
2        Verdict                                         2.4800
3        Phantomlight                                    2.4900
4        Bloodlord's Fetish                              1.7000
                                                          ...
178      Oathbreaker, Last Hope of the Breaking Storm    4.2300
179      Wolf, Promise of the Moonwalker                 4.4800
181      Reaper's Toll                                   1.6600
182      Toothpick                                       4.0300
183      Dragon's Greatsword                             1.0900
Name: Price, Length: 179, dtype: float64

In [59]:
most_pop_purchase_count = item_group["Price"].count()
most_pop_purchase_count

Item ID  Item Name
0        Splinter                                         4
1        Crucifer                                         4
2        Verdict                                          6
3        Phantomlight                                     6
4        Bloodlord's Fetish                               5
                                                         ..
178      Oathbreaker, Last Hope of the Breaking Storm    12
179      Wolf, Promise of the Moonwalker                  6
181      Reaper's Toll                                    5
182      Toothpick                                        3
183      Dragon's Greatsword                              3
Name: Price, Length: 179, dtype: int64

In [60]:
most_popular_demografics = pd.DataFrame({"Purchase Count": most_pop_purchase_count,
                                         "Item Price": most_pop_average_price,
                                       "Total Purchase Value":most_pop_total_purchase})
most_popular_demografics

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
0,Splinter,4,1.2800,5.12
1,Crucifer,4,2.9425,11.77
2,Verdict,6,2.4800,14.88
3,Phantomlight,6,2.4900,14.94
4,Bloodlord's Fetish,5,1.7000,8.50
...,...,...,...,...
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.2300,50.76
179,"Wolf, Promise of the Moonwalker",6,4.4800,26.88
181,Reaper's Toll,5,1.6600,8.30
182,Toothpick,3,4.0300,12.09
183,Dragon's Greatsword,3,1.0900,3.27

In [61]:
most_popular_demografics.sort_values("Purchase Count", ascending=False).head(5)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77

In [57]:
##Most Profitable Items

In [58]:
most_popular_demografics.sort_values("Total Purchase Value", ascending=False).head(5)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80